//데이터 구간
console.log("JS 작동중");
const data = [
  {
    age: "유아",
    categories: [
      "성장","가족","몸","학교","사람","동물","벌레","식물","날씨",
      "옛이야기","미래","과거","지도","흥미로운","무서운","슬픈",
      "사랑","우정","과학","스포츠","그림/노래","음식","미스터리","판타지"
    ],
    types: ["그림책","유아학습","놀이학습"]
  },
  {
    age: "초등학생",
    categories: [
      "성장","가족","몸","학교","사람","동물","벌레","식물","날씨",
      "옛이야기","미래","과거","지도","흥미로운","무서운","슬픈",
      "사랑","우정","과학","스포츠","그림/노래","음식","미스터리","판타지"
    ],
    types: ["어린이문학","어린이학습/교양","어린이만화"]
  },
  {
    age: "중고등학생",
    categories: ["인권","정보","공부","진로","감정","여가","일탈","가정","친구","이성"],
    types: [
      "소설","에세이/시/희곡","인문","자기계발","경제/경영",
      "가정/취미/실용","의학/건강","여행/지리","과학/기술",
      "사회과학","종교","역사/문화","인물/평전",
      "예술/대중문화","외국어","컴퓨터","만화","청소년"
    ]
  },
  {
    age: "20대",
    categories: ["사랑","인생설계","인생철학","자기계발","일","결혼","행복","습관","마음","여행","취미"],
    types: [
      "소설","에세이/시/희곡","인문","자기계발","경제/경영",
      "가정/취미/실용","의학/건강","여행/지리","과학/기술",
      "사회과학","종교","역사/문화","인물/평전",
      "예술/대중문화","외국어","컴퓨터","만화"
    ]
  },
  {
    age: "30대",
    categories: [
      "예비부모","영아자녀고육","유아자녀교육","초등자녀교육","중고등자녀교육",
      "사랑","인생설계","인생철학","자기계발","일","결혼","행복","습관","마음","여행","취미"
    ],
    types: [
      "소설","에세이/시/희곡","인문","자기계발","경제/경영",
      "가정/취미/실용","의학/건강","여행/지리","과학/기술",
      "사회과학","종교","역사/문화","인물/평전",
      "예술/대중문화","외국어","컴퓨터","만화","부모"
    ]
  },
  {
    age: "40대",
    categories: [
      "유아자녀교육","초등자녀교육","중고등자녀교육",
      "행복","습관","마음","여행","취미"
    ],
    types: [
      "소설","에세이/시/희곡","인문","자기계발","경제/경영",
      "가정/취미/실용","의학/건강","여행/지리","과학/기술",
      "사회과학","종교","역사/문화","인물/평전",
      "예술/대중문화","외국어","컴퓨터","만화","부모"
    ]
  },
  {
    age: "50대",
    categories: [
      "인생관","웰에이징","웰다잉","라이프스타일","은퇴","직업탐구",
      "자산관리","귀농귀촌","가족관계","사회관계","질병","운동","노화","식생활"
    ],
    types: [
      "소설","에세이/시/희곡","인문","자기계발","경제/경영",
      "가정/취미/실용","의학/건강","여행/지리","과학/기술",
      "사회과학","종교","역사/문화","인물/평전",
      "예술/대중문화","외국어","컴퓨터","만화"
    ]
  }
];
//전역변수구간
const contentsArea = document.querySelector(".contents");//본문
const userLikeBox = contentsArea.querySelector(".user-like"); //2단계
const userAgeBox = contentsArea.querySelector(".user-age");//1단계 div
const processBtns = document.querySelector(".select-process-btns");//행동버튼
const nextBtn = processBtns.querySelector(".next-btn");
//로직 구간 ,함수작성부분

contentsArea.addEventListener("click", (e)=>{
  if(e.target.tagName === "BUTTON"){
    e.target.classList.add("on");
    nextBtn.style.backgroundColor = "#1b6eab"
    nextBtn.style.color = "#FFF;"
    }

  contentsArea.forEach(function(b){
      b.classList.remove("on");
    });
    this.classList.add("on");
console.log("클릭됨"); 
})
nextBtn.addEventListener("click", ()=>{
  userAgeBox.classList.remove("on");
  userLikeBox.classList.add("on");
})
